In [2]:
import pandas as pd

In [3]:
data = "running.csv"
df = pd.read_csv(data)
df.head()

     ID Univ  Grade  Time
0  1001    D      3  1870
1  1004    C      1  1957
2  1006    D      2  2063
3  1007    D      3  1839
4  1008    C      2  1740

In [5]:
print(df.shape) 
print(df.info())
display(df.head())

(47, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      47 non-null     int64
 1   Univ    47 non-null     object
 2   Grade   47 non-null     int64
 3   Time    47 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade  Time
0  1001    D      3  1870
1  1004    C      1  1957
2  1006    D      2  2063
3  1007    D      3  1839
4  1008    C      2  1740

In [7]:
df["Grade"].value_counts()

Grade
3    14
1    11
2    11
4    11
Name: count, dtype: int64

In [8]:
pd.crosstab(df['Univ'], df['Grade'])

Grade  1  2  3  4
Univ
A      3  4  5  4
B      2  1  2  3
C      1  3  1  3
D      5  3  6  1

In [10]:
df.sort_values(by='Time', ascending=True).head()

      ID Univ  Grade  Time
4   1008    C      2  1740
26  1030    D      3  1761
38  1042    A      3  1764
8   1012    A      3  1783
24  1028    B      4  1785